# pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
a = pd.Series(range(20))
a

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
dtype: int64

In [3]:
a.cumsum()

0       0
1       1
2       3
3       6
4      10
5      15
6      21
7      28
8      36
9      45
10     55
11     66
12     78
13     91
14    105
15    120
16    136
17    153
18    171
19    190
dtype: int64

## pd.Series

In [4]:
a = pd.Series([1, 2, 3, 4])
a

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
a = pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])
a

a    1
b    2
c    3
d    4
dtype: int64

In [6]:
a.index, a.values

(Index(['a', 'b', 'c', 'd'], dtype='object'), array([1, 2, 3, 4], dtype=int64))

In [7]:
a['a']

1

In [8]:
b = pd.Series([2, 2, 3, 3], index=[ 'b', 'c', 'd', 'e'])
a + b

a    NaN
b    4.0
c    5.0
d    7.0
e    NaN
dtype: float64

In [9]:
a.name = 'series'
a.index.name = 'cols'
a

cols
a    1
b    2
c    3
d    4
Name: series, dtype: int64

## pd.DataFrame

In [10]:
a = pd.DataFrame(np.arange(16).reshape(4, 4))
a

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [11]:
a.columns = ['a', 'b', 'c', 'd']
a

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [12]:
a['a']

0     0
1     4
2     8
3    12
Name: a, dtype: int32

In [13]:
a.loc[0]

a    0
b    1
c    2
d    3
Name: 0, dtype: int32

In [14]:
a.head(3)

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [15]:
a = a.reindex(columns=['b', 'c', 'd', 'a'])
a

    b   c   d   a
0   1   2   3   0
1   5   6   7   4
2   9  10  11   8
3  13  14  15  12

In [16]:
a = a.reindex(index=[1, 2, 3, 0])
a

    b   c   d   a
1   5   6   7   4
2   9  10  11   8
3  13  14  15  12
0   1   2   3   0

In [24]:
new_cols = a.columns.insert(4, 'e')
new_cols

Index(['b', 'c', 'd', 'a', 'e'], dtype='object')

In [29]:
a.index

Int64Index([1, 2, 3, 0], dtype='int64')

In [60]:
new_a = a.reindex(columns=new_cols)

In [42]:
new_a

    b   c   d   a   e
1   5   6   7   4 NaN
2   9  10  11   8 NaN
3  13  14  15  12 NaN
0   1   2   3   0 NaN

In [44]:
new_a = new_a.drop('e', axis=1)
new_a

    b   c   d   a
1   5   6   7   4
2   9  10  11   8
3  13  14  15  12
0   1   2   3   0

In [45]:
x = pd.DataFrame(np.arange(24).reshape(4, 6))
y = pd.DataFrame(np.arange(24).reshape(3, 8))
x, y

(    0   1   2   3   4   5
 0   0   1   2   3   4   5
 1   6   7   8   9  10  11
 2  12  13  14  15  16  17
 3  18  19  20  21  22  23,
     0   1   2   3   4   5   6   7
 0   0   1   2   3   4   5   6   7
 1   8   9  10  11  12  13  14  15
 2  16  17  18  19  20  21  22  23)

In [46]:
z = x + y
z

      0     1     2     3     4     5   6   7
0   0.0   2.0   4.0   6.0   8.0  10.0 NaN NaN
1  14.0  16.0  18.0  20.0  22.0  24.0 NaN NaN
2  28.0  30.0  32.0  34.0  36.0  38.0 NaN NaN
3   NaN   NaN   NaN   NaN   NaN   NaN NaN NaN

In [47]:
z = x * y
z

       0      1      2      3      4      5   6   7
0    0.0    1.0    4.0    9.0   16.0   25.0 NaN NaN
1   48.0   63.0   80.0   99.0  120.0  143.0 NaN NaN
2  192.0  221.0  252.0  285.0  320.0  357.0 NaN NaN
3    NaN    NaN    NaN    NaN    NaN    NaN NaN NaN

In [49]:
x = x.sort_index(ascending=False)
x

    0   1   2   3   4   5
3  18  19  20  21  22  23
2  12  13  14  15  16  17
1   6   7   8   9  10  11
0   0   1   2   3   4   5

In [50]:
x = x.sort_index(ascending=False, axis=1)
x

    5   4   3   2   1   0
3  23  22  21  20  19  18
2  17  16  15  14  13  12
1  11  10   9   8   7   6
0   5   4   3   2   1   0

In [55]:
x = x.sort_values(3)
x

    5   4   3   2   1   0
0   5   4   3   2   1   0
1  11  10   9   8   7   6
2  17  16  15  14  13  12
3  23  22  21  20  19  18

In [57]:
new_a.sort_values('b')

    b   c   d   a
0   1   2   3   0
1   5   6   7   4
2   9  10  11   8
3  13  14  15  12

In [58]:
new_a.sort_values(2, axis=1)

    a   b   c   d
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
0   0   1   2   3

In [61]:
new_a.sum()

b    28.0
c    32.0
d    36.0
a    24.0
e     0.0
dtype: float64

In [73]:
x.describe() # 对列进行计算

               5          4          3          2          1          0
count   4.000000   4.000000   4.000000   4.000000   4.000000   4.000000
mean   14.000000  13.000000  12.000000  11.000000  10.000000   9.000000
std     7.745967   7.745967   7.745967   7.745967   7.745967   7.745967
min     5.000000   4.000000   3.000000   2.000000   1.000000   0.000000
25%     9.500000   8.500000   7.500000   6.500000   5.500000   4.500000
50%    14.000000  13.000000  12.000000  11.000000  10.000000   9.000000
75%    18.500000  17.500000  16.500000  15.500000  14.500000  13.500000
max    23.000000  22.000000  21.000000  20.000000  19.000000  18.000000

In [77]:
x.describe().loc['max']

5    23.0
4    22.0
3    21.0
2    20.0
1    19.0
0    18.0
Name: max, dtype: float64

In [78]:
x.describe()[1]

count     4.000000
mean     10.000000
std       7.745967
min       1.000000
25%       5.500000
50%      10.000000
75%      14.500000
max      19.000000
Name: 1, dtype: float64